Revit 2027 API
GeometryInstance.GetDocument Method
Gets the document that contains the symbol of this instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Document GetDocument()
Public Function GetDocument As Document
public:
Document^ GetDocument()
member GetDocument : unit -> Document
Return Value
Document
Returns the document that contains the symbol of this instance.
See Also
Reference
GeometryInstance Class
Autodesk.Revit.DB Namespace